// pages/home/readDetail/readDetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {

    text:"而在微信用户量较高区域，如东南亚，腾讯于去年在马来西亚获得第三方支付牌照，并于上个月上线马来西亚版的微信钱包。在香港，腾讯于2016年8月获得香港金管局颁发的首批第三方支付牌照。腾讯方面表示，微信香港钱包支持用户绑定中国银行（香港）、中国工商银行（亚洲）、大新银行和中信银行（国际）的储蓄账户及香港任何银行的Visa(140.9,1.26,0.90%)和Mastercard信用卡，并可通过包括汇丰、渣打、花旗、恒生在内的全港17家银行直接付款预授权（DDA）为微信香港钱包充值。而在微信用户量较高区域，如东南亚，腾讯于去年在马来西亚获得第三方支付牌照，并于上个月上线马来西亚版的微信钱包。在香港，腾讯于2016年8月获得香港金管局颁发的首批第三方支付牌照。腾讯方面表示，微信香港钱包支持用户绑定中国银行（香港）、中国工商银行（亚洲）、大新银行和中信银行（国际）的储蓄账户及香港任何银行的Visa(140.9,1.26,0.90%)和Mastercard信用卡，并可通过包括汇丰、渣打、花旗、恒生在内的全港17家银行直接付款预授权（DDA）为微信香港钱包充值。而在微信用户量较高区域，如东南亚，腾讯于去年在马来西亚获得第三方支付牌照，并于上个月上线马来西亚版的微信钱包。在香港，腾讯于2016年8月获得香港金管局颁发的首批第三方支付牌照。腾讯方面表示，微信香港钱包支持用户绑定中国银行（香港）、中国工商银行（亚洲）、大新银行和中信银行（国际）的储蓄账户及香港任何银行的Visa(140.9,1.26,0.90%)和Mastercard信用卡，并可通过包括汇丰、渣打、花旗、恒生在内的全港17家银行直接付款预授权（DDA）为微信香港钱包充值。66666666666667777777777565575655567565575576565656565656565656575675657",
    testUrl: "http://wimg.spriteapp.cn/ugc/2018/07/17/5b4dd5046ac84_1.jpg"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

    wx.setNavigationBarTitle({
      title: '山雀子躁醒的江南',
    })
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})